/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Subtitle" = "Te has conectado correctamente a %@.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Title" = "Conexión establecida";

/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Subtitle" = "Tu conexión a %@ se ha actualizado correctamente.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Title" = "Actualización correcta";

/* Description shown in the concent information screen. */
"ConsentInformation.Description" = "Si sigues usando este servicio, recopilaremos datos financieros. Esta es la información que recopilaremos sobre ti: ";

/* Title shown in the concent information screen. */
"ConsentInformation.Title" = "Recopilaremos los siguientes datos tuyos";

/* Description text for add credentials screen. */
"Credentials.Description" = "Inicia sesión en %@ para continuar";


/* Text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.ConsentText" = "%@ obtendrá parte de tu información financiera. Más información";
/* Title for action to continue adding credentials. */
"Credentials.Discard.ContinueAction" = "Seguir editando";

/* Title for action to discard adding credentials. */
"Credentials.Discard.PrimaryAction" = "Descartar cambios";

/* Title for action sheet presented when user tries to dismiss modal while adding credentials. */
"Credentials.Discard.Title" = "¿Seguro que quieres descartar esta nueva credencial?";

/* Title for error shown when authentication failed while adding credentials. */
"Credentials.Error.AuthenticationFailed" = "Error de autenticación";

/* Message for error shown when credentials already exists. */
"Credentials.Error.CredentialsAlreadyExists" = "Ya tienes una conexión a este banco o servicio.";

/* Title for error shown when a permanent failure occured while adding credentials. */
"Credentials.Error.PermanentFailure" = "Error permanente";

/* Title for error shown when a temporary failure occured while adding credentials. */
"Credentials.Error.TemporaryFailure" = "Error temporal";

/* Text for BankID button shown in the add credentials/authenticate screen. */
"Credentials.OpenBankID" = "Abrir BankID";

/* Privacy policy clickable text used in Credentials.TermsAndConsentText. The text copy should be exactly same as it is in the Credentials.TermsAndConsentText */
"Credentials.PrivacyPolicy" = "Política de privacidad";


/* Read more text (clickable) to lead to consent information. */
"Credentials.ReadMore" = "Más información";
/* Terms and conditions clickable text used in Credentials.TermsAndConsentText. The text copy should be exactly same as it is in the Credentials.TermsAndConsentText */
"Credentials.TermsAndConditions" = "Términos y condiciones";

/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions, Privacy Policy. And the text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.TermsAndConsentText" = "Al usar el servicio, aceptas los %@ y la %@ de Tink. %@ obtendrá secciones de tu información financiera. %@";


/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions and Privacy Policy. */
"Credentials.TermsText" = "Al usar el servicio, aceptas los Términos y condiciones y la Política de privacidad de Tink.";
/* Title for add credentials/authenticate screen. */
"Credentials.Title" = "Autentificación";


/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Subtitle" = "Tu cuenta se ha conectado correctamente a %@.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Title" = "Conexión establecida";
/* Text for the warning shown when the developer is unverified. */
"Credentials.UnverifiedClient" = "Sin verificar: Esta solución se ha creado solo con propósitos de desarrollo. No introduzcas tus credenciales del banco a menos que confíes en el desarrollador. ";

/* View details text (clickable) to lead to consent information that used in Credentials.TermsAndConsentText. The text copy should be exactly same as it is in the Credentials.TermsAndConsentText */
"Credentials.ViewDetails" = "Consulta los detalles";

/* Text shown for progress indicator dialog when in loading state. */
"CredentialsStatus.Authorizing" = "Autorizando...";

/* Text shown for dialog when supplemental information is cancelled and waiting for credential status update. */
"CredentialsStatus.Cancelling" = "Cancelando...";

/* Text shown for dialog when supplemental information is submitted and waiting for credential status update. */
"CredentialsStatus.Sending" = "Enviando...";

/* Text shown for progress indicator dialog when status is CredentialStatus.Updating. */
"CredentialsStatus.Updating" = "Conectando con %@, espera...";

/* Fallback text shown when fail to get bank name while updating credentials. */
"CredentialsStatus.UpdatingFallback" = "Conectando, espera...";

/* Text shown when adding credentials and waiting for authentication on another device. */
"CredentialsStatus.WaitingForAuthenticationOnAnotherDevice" = "Esperando autenticación en otro dispositivo.";

/* Text for field validation error shown when text entered exceeds character limit. */
"Field.Validation.MaxLengthLimit" = "Este campo no puede contener más de %d caracteres.";

/* Text for field validation error shown when text entered is shorter than required. */
"Field.Validation.MinLengthLimit" = "Este campo debe tener al menos %d caracteres.";

/* Text for field validation error shown when no text is entered for a required field. */
"Field.Validation.RequiredFieldEmptyValue" = "Este campo no puede estar vacío.";

/* Text used to form a list. */
"Generic.And" = "y";

/* Text shown for Cancel button. */
"Generic.Cancel" = "Cancelar";

/* Title for cancelled request. */
"Generic.Cancelled" = "Cancelado";

/* Title for generic button to continue an action. */
"Generic.Continue" = "Continuar";

/* Title for action to dismiss error alert. */
"Generic.Dismiss" = "Descartar";

/* Title for action to confirm an event. */
"Generic.Done" = "Terminado";

/* Title generic alert. */
"Generic.Error" = "Se ha producido un error. Vuelve a intentarlo más tarde.";

/* Title for generic text to login. */
"Generic.Login" = "Iniciar sesión";

/* Title for action to confirm alert. */
"Generic.OK" = "Aceptar";

/* Title for action to retry a failed request. */
"Generic.Retry" = "Volver a intentar";

/* Title for error alert if error doesn't contain a description. */
"Generic.ServiceAlert.FallbackTitle" = "El servicio no está disponible en este momento.";

/* Description of the provider capability Checking Accounts. */
"ProviderCapability.CheckingAccounts" = "Cuentas corrientes";

/* Description of the provider capability Credit Cards. */
"ProviderCapability.CreditCards" = "Tarjetas de crédito";

/* Description of the provider capability E-Invoices. */
"ProviderCapability.EInvoices" = "Facturas electrónicas";

/* Description of the provider capability Identity Data. */
"ProviderCapability.IdentityData" = "Datos de identidad";

/* Description of the provider capability Investments. */
"ProviderCapability.Investments" = "Inversiones";

/* Description of the provider capability Loans. */
"ProviderCapability.Loans" = "Préstamos";

/* Description of the provider capability Mortgage Aggregation. */
"ProviderCapability.MortgageAggregation" = "Agregación de hipotecas";

/* Description of the provider capability Mortgage Loan. */
"ProviderCapability.MortgageLoan" = "Préstamo hipotecario";

/* Description of the provider capability Payments. */
"ProviderCapability.Payments" = "Pagos";

/* Description of the provider capability Savings Accounts. */
"ProviderCapability.SavingsAccounts" = "Cuentas de ahorro";

/* Description of the provider capability Transfers. */
"ProviderCapability.Transfers" = "Transferencias";

/* Description for error when providers could not be loaded. */
"ProviderList.Error.Description" = "Estamos informados de este error y estamos trabajando para resolverlo. Ten paciencia e inténtalo un poco más tarde.";

/* Description for error when providers could not be loaded and it is likely it's a temporary error. */
"ProviderList.Error.Temporary" = "Podría tratarse de un error temporal. Vuelve a intentarlo y comprueba si el problema se sigue produciendo.";

/* Title for when providers could not be loaded. */
"ProviderList.Error.Title" = "Lo sentimos, pero no hemos podido cargar ningún banco en este momento.";

/* Placeholder in search field shown in provider list. */
"ProviderList.SearchHint" = "Buscar por banco o tarjeta";

/* Title for list of all providers. */
"ProviderList.Title" = "Elegir banco";

/* Information text shown in the choose access type screen. */
"SelectAccessType.Information" = "Debido a las normativas de la UE, los tipos de cuenta diferentes deben conectarse por separado.";

/* Title for the other account type (not an open banking account type) on the choose access type screen. */
"SelectAccessType.OtherType" = "Otros";

/* Title of the choose access type screen. */
"SelectAccessType.Title" = "Tipo de conexión";

/* Title for the business authentication user type */
"SelectAuthenticationUserType.Business" = "Empresarial";

/* Title for the corporate authentication user type */
"SelectAuthenticationUserType.Corporate" = "Corporativa";

/* Title for the personal authentication user type */
"SelectAuthenticationUserType.Personal" = "Personal";

/* Title when picking authentication user type. */
"SelectAuthenticationUserType.Title" = "Tipo de inicio de sesión";

/* Title for choose credential type screen. */
"SelectCredentialsType.Title" = "Método de inicio de sesión";

/* Description shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeDescription" = "Abre la aplicación de Mobile BankID y escanea este código QR para autenticarte.";

/* Error shown when QR code cannot be fetched/generated/displayed. */
"SupplementalInformation.QRCodeError" = "Se produjo un error al cargar el código QR. Vuelve a intentarlo más tarde.";

/* Title shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeTitle" = "Abre la aplicación BankID.";

/* Title for button to submit supplemental information. */
"SupplementalInformation.Submit" = "Enviar";

/* Title of the supplemental information dialog. */
"SupplementalInformation.Title" = "Información complementaria";

/* Title for action to download app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Download" = "Descargar";

